import math
#1.1
print("1.1)",30 + 1, 20 - 2, 80 - 1)
#1.2
print("1.2)", 50-3, 50+2, 100+50, sep="  ")
#1.3
print("1.3)", "50\n     10")
#1.4
print("1.4)", "5\n     10\n     21")
#1.5
print("1.5)", "1\n\n     2")
#1.6
print("1.6)", f"{math.pi:.3f}")
#1.7
print("1.7)", f"{math.e:.1f}")
#1.8
print("1.8)")
x = input("введите число: ")
print("вы ввели число", x)
#1.9
print("1.9)")
x = input("Введите число: ")
print(x, "— вот какое число Вы ввели")
#1.10
print("1.10)")
name = input("Введите имя: ")
print(name)
#1.11
print("1.11)")
team = input("Введите название футбольной команды: ")
print(team, "- это чемпион!")
#1.12
print("1.12)")
name = input("Введите ваше имя: ")
print("Привет,", name + "!")
#1.13
print("1.13)")
num = int(input("Введите целое число: "))
print("Следующее за числом", num, "число -", num + 1, ".")
print("Для числа", num, "предыдущее число -", num - 1, ".")
#1.14
print("1.14)")
a = input("Введите первое число: ")
b = input("Введите второе число: ")
c = input("Введите третье число: ")

print(a, b, c, sep="  ")
#1.15
print("1.15)")
a = input("Введите первое число: ")
b = input("Введите второе число: ")
c = input("Введите третье число: ")
d = input("Введите четвертое число: ")

print(a, b, c, d)
#1.16
print("1.16)")
t = int(input("Введите t: "))
v = int(input("Введите v: "))
x = int(input("Введите x: "))
y = int(input("Введите y: "))

print("a)5 10 \tб)100", t, "\tв)", x, "25" )
print("  7 см \t  1949", v, "\t  ", x, y)


#1.17
print("1.17)")
a = int(input("Введите a: "))
b = int(input("Введите b: "))
x = int(input("Введите x: "))
y = int(input("Введите y: "))

print(" a)2 кг \tб)",a ,"1","\tв)", x, y)
print("   13 17 \t  19", b, "\t  ", "5", y)

